Samplecode-MM32/MM32W0xxxxB_samplecode/MM32W0xxxxB_s_samplecode/MM32W0xx_s_BLE_gcc_SV3.6.1/Device/MM32W0xx/Include/MM32W0xx.h
/*******************  Bit definition for CAN_PELI_IR register  *******************/
#define  CAN_PELI_IR_RI                           	 ((uint16_t)0x0001)     
#define  CAN_PELI_IR_TI                           	 ((uint16_t)0x0002)   
#define  CAN_PELI_IR_EI                           	 ((uint16_t)0x0004)   
#define  CAN_PELI_IR_DOI                         	 ((uint16_t)0x0008)   
#define  CAN_PELI_IR_WUI                          	 ((uint16_t)0x0010) 
#define  CAN_PELI_IR_EPI                             ((uint16_t)0x0020) 
#define  CAN_PELI_IR_ALI                         	 ((uint16_t)0x0040) 
#define  CAN_PELI_IR_BEI                          	 ((uint16_t)0x0080) 


/*******************  Bit definition for CAN_PELI_IER register  *******************/
#define  CAN_PELI_IER_RIE							 ((uint16_t)0x0001)
#define  CAN_PELI_IER_TIE							 ((uint16_t)0x0002)
#define  CAN_PELI_IER_EIE							 ((uint16_t)0x0004)
#define  CAN_PELI_IER_DOIE							 ((uint16_t)0x0008)
#define  CAN_PELI_IER_WUIE							 ((uint16_t)0x0010)
#define  CAN_PELI_IER_EPIE							 ((uint16_t)0x0020)
#define  CAN_PELI_IER_ALIE							 ((uint16_t)0x0040)
#define  CAN_PELI_IER_BEIE							 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_PELI_BTR0 register  *******************/
#define  CAN_PELI_BTR0_BRP                        	 ((uint16_t)0x003F)     
#define  CAN_PELI_BTR0_BRP_0                      	 ((uint16_t)0x0001)   
#define  CAN_PELI_BTR0_BRP_1                      	 ((uint16_t)0x0002) 
#define  CAN_PELI_BTR0_BRP_2                      	 ((uint16_t)0x0004)  
#define  CAN_PELI_BTR0_BRP_3                      	 ((uint16_t)0x0008) 
#define  CAN_PELI_BTR0_BRP_4                     	 ((uint16_t)0x0010)  
#define  CAN_PELI_BTR0_BRP_5                   	     ((uint16_t)0x0020)  

#define  CAN_PELI_BTR0_SJW                        	 ((uint16_t)0x00C0)   
#define  CAN_PELI_BTR0_SJW_0                      	 ((uint16_t)0x0040)
#define  CAN_PELI_BTR0_SJW_1                      	 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_PELI_BTR1 register  *******************/
#define  CAN_PELI_BTR1_SAM                        	 ((uint16_t)0x0080) 

#define  CAN_PELI_BTR1_TSEG1                      	 ((uint16_t)0x000F)     
#define  CAN_PELI_BTR1_TSEG1_0                   	 ((uint16_t)0x0001)   
#define  CAN_PELI_BTR1_TSEG1_1                    	 ((uint16_t)0x0002) 
#define  CAN_PELI_BTR1_TSEG1_2                    	 ((uint16_t)0x0004)  
#define  CAN_PELI_BTR1_TSEG1_3                   	 ((uint16_t)0x0008)

#define  CAN_PELI_BTR1_TSEG2                     	 ((uint16_t)0x0070)     
#define  CAN_PELI_BTR1_TSEG2_0                   	 ((uint16_t)0x0010)   
#define  CAN_PELI_BTR1_TSEG2_1                   	 ((uint16_t)0x0020) 
#define  CAN_PELI_BTR1_TSEG2_2                   	 ((uint16_t)0x0040)

/*******************  Bit definition for CAN_PELI_ALC register  *******************/
#define  CAN_PELI_ALC_BITNO							 ((uint16_t)0x001F)
#define  CAN_PELI_ALC_BITNO_0						 ((uint16_t)0x0001)
#define  CAN_PELI_ALC_BITNO_1						 ((uint16_t)0x0002)
#define  CAN_PELI_ALC_BITNO_2						 ((uint16_t)0x0004)
#define  CAN_PELI_ALC_BITNO_3						 ((uint16_t)0x0008)
#define  CAN_PELI_ALC_BITNO_4						 ((uint16_t)0x0010)

/*******************  Bit definition for CAN_PELI_ECC register  *******************/
#define  CAN_PELI_ECC_DIR							 ((uint16_t)0x0020)

#define  CAN_PELI_ECC_SEG							 ((uint16_t)0x001F)
#define  CAN_PELI_ECC_SEG_0							 ((uint16_t)0x0001)
#define  CAN_PELI_ECC_SEG_1							 ((uint16_t)0x0002)
#define  CAN_PELI_ECC_SEG_2							 ((uint16_t)0x0004)
#define  CAN_PELI_ECC_SEG_3							 ((uint16_t)0x0008)
#define  CAN_PELI_ECC_SEG_4							 ((uint16_t)0x0010)

#define  CAN_PELI_ECC_ERRC							 ((uint16_t)0x00C0)
#define  CAN_PELI_ECC_ERRC_0						 ((uint16_t)0x0040)
#define  CAN_PELI_ECC_ERRC_1						 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_PELI_EWLR register  *******************/
#define  CAN_PELI_EWLR_EWL							 ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_PELI_RXERR register  *******************/
#define  CAN_PELI_RXERR_RXERR						 ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_PELI_TXERR register  *******************/
#define  CAN_PELI_TXERR_TXERR						 ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_PELI_FF register  *******************/
#define  CAN_PELI_SFF_RTR							  ((uint16_t)0x0040)
#define  CAN_PELI_SFF_FF						 	 ((uint16_t)0x0080)
#define  CAN_PELI_SFF_DLC						  	 ((uint16_t)0x000F)
#define  CAN_PELI_SFF_DLC_0						 	 ((uint16_t)0x0001)
#define  CAN_PELI_SFF_DLC_1						 	 ((uint16_t)0x0002)
#define  CAN_PELI_SFF_DLC_2						 	 ((uint16_t)0x0004)
#define  CAN_PELI_SFF_DLC_3						 	 ((uint16_t)0x0008)

#define  CAN_PELI_EFF_RTR						 	 ((uint16_t)0x0040)
#define  CAN_PELI_EFF_FF						 	 ((uint16_t)0x0080)
#define  CAN_PELI_EFF_DLC						 	 ((uint16_t)0x000F)
#define  CAN_PELI_EFF_DLC_0						 	 ((uint16_t)0x0001)
#define  CAN_PELI_EFF_DLC_1						 	 ((uint16_t)0x0002)
#define  CAN_PELI_EFF_DLC_2							 ((uint16_t)0x0004)
#define  CAN_PELI_EFF_DLC_3						 	 ((uint16_t)0x0008)


/*******************  Bit definition for CAN_PELI_TXID0 register  *******************/
#define  CAN_PELI_TXID0						         ((uint16_t)0x00FF)
#define  CAN_PELI_TXID0_ID21						 ((uint16_t)0x0001)
#define  CAN_PELI_TXID0_ID22						 ((uint16_t)0x0002)
#define  CAN_PELI_TXID0_ID23						 ((uint16_t)0x0004)
#define  CAN_PELI_TXID0_ID24						 ((uint16_t)0x0008)
#define  CAN_PELI_TXID0_ID25						 ((uint16_t)0x0010)
#define  CAN_PELI_TXID0_ID26						 ((uint16_t)0x0020)
#define  CAN_PELI_TXID0_ID27						 ((uint16_t)0x0040)
#define  CAN_PELI_TXID0_ID28						 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_PELI_TXID1 register  *******************/
#define  CAN_PELI_TXID1						         ((uint16_t)0x00FF)
#define  CAN_PELI_TXID1_ID13						 ((uint16_t)0x0001)
#define  CAN_PELI_TXID1_ID14						 ((uint16_t)0x0002)
#define  CAN_PELI_TXID1_ID15						 ((uint16_t)0x0004)
#define  CAN_PELI_TXID1_ID16						 ((uint16_t)0x0008)
#define  CAN_PELI_TXID1_ID17						 ((uint16_t)0x0010)
#define  CAN_PELI_TXID1_ID18						 ((uint16_t)0x0020)
#define  CAN_PELI_TXID1_ID19						 ((uint16_t)0x0040)
#define  CAN_PELI_TXID1_ID20						 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_PELI_TXID2 register  *******************/
#define  CAN_PELI_TXID2						         ((uint16_t)0x00FF)
#define  CAN_PELI_TXID2_ID05						 ((uint16_t)0x0001)
#define  CAN_PELI_TXID2_ID06						 ((uint16_t)0x0002)
#define  CAN_PELI_TXID2_ID07						 ((uint16_t)0x0004)
#define  CAN_PELI_TXID2_ID08						 ((uint16_t)0x0008)
#define  CAN_PELI_TXID2_ID09						 ((uint16_t)0x0010)
#define  CAN_PELI_TXID2_ID10						 ((uint16_t)0x0020)
#define  CAN_PELI_TXID2_ID11						 ((uint16_t)0x0040)
#define  CAN_PELI_TXID2_ID12						 ((uint16_t)0x0080)

