Samplecode-MM32/MM32W0xxxxB_samplecode/MM32W0xxxxB_s_samplecode/MM32W0xx_s_BLE_gcc_SV3.6.1/Device/MM32W0xx/Include/MM32W0xx.h
/*******************  Bit definition for CAN_PELI_TXID3 register  *******************/
#define  CAN_PELI_TXID3						         ((uint16_t)0x00FF)
#define  CAN_PELI_TXID3_ID00						 ((uint16_t)0x0008)
#define  CAN_PELI_TXID3_ID01						 ((uint16_t)0x0010)
#define  CAN_PELI_TXID3_ID02						 ((uint16_t)0x0020)
#define  CAN_PELI_TXID3_ID03						 ((uint16_t)0x0040)
#define  CAN_PELI_TXID3_ID04						 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_PELI_TXDATA0 register  *******************/
#define  CAN_PELI_TXDATA0							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_TXDATA1 register  *******************/
#define  CAN_PELI_TXDATA1							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_TXDATA2 register  *******************/
#define  CAN_PELI_TXDATA2							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_TXDATA3 register  *******************/
#define  CAN_PELI_TXDATA3							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_TXDATA4 register  *******************/
#define  CAN_PELI_TXDATA4							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_TXDATA5 register  *******************/
#define  CAN_PELI_TXDATA5							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_TXDATA6 register  *******************/
#define  CAN_PELI_TXDATA6							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_TXDATA7 register  *******************/
#define  CAN_PELI_TXDATA7							 ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_PELI_RXID0 register  *******************/
#define  CAN_PELI_RXID0						         ((uint16_t)0x00FF)
#define  CAN_PELI_RXID0_ID21						 ((uint16_t)0x0001)
#define  CAN_PELI_RXID0_ID22						 ((uint16_t)0x0002)
#define  CAN_PELI_RXID0_ID23						 ((uint16_t)0x0004)
#define  CAN_PELI_RXID0_ID24						 ((uint16_t)0x0008)
#define  CAN_PELI_RXID0_ID25						 ((uint16_t)0x0010)
#define  CAN_PELI_RXID0_ID26						 ((uint16_t)0x0020)
#define  CAN_PELI_RXID0_ID27						 ((uint16_t)0x0040)
#define  CAN_PELI_RXID0_ID28						 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_PELI_RXID1 register  *******************/
#define  CAN_PELI_RXID1						         ((uint16_t)0x00FF)
#define  CAN_PELI_RXID1_ID13						 ((uint16_t)0x0001)
#define  CAN_PELI_RXID1_ID14						 ((uint16_t)0x0002)
#define  CAN_PELI_RXID1_ID15						 ((uint16_t)0x0004)
#define  CAN_PELI_RXID1_ID16						 ((uint16_t)0x0008)
#define  CAN_PELI_RXID1_ID17						 ((uint16_t)0x0010)
#define  CAN_PELI_RXID1_ID18						 ((uint16_t)0x0020)
#define  CAN_PELI_RXID1_ID19						 ((uint16_t)0x0040)
#define  CAN_PELI_RXID1_ID20						 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_PELI_RXID2 register  *******************/
#define  CAN_PELI_RXID2						         ((uint16_t)0x00FF)
#define  CAN_PELI_RXID2_ID05						 ((uint16_t)0x0001)
#define  CAN_PELI_RXID2_ID06						 ((uint16_t)0x0002)
#define  CAN_PELI_RXID2_ID07						 ((uint16_t)0x0004)
#define  CAN_PELI_RXID2_ID08						 ((uint16_t)0x0008)
#define  CAN_PELI_RXID2_ID09						 ((uint16_t)0x0010)
#define  CAN_PELI_RXID2_ID10						 ((uint16_t)0x0020)
#define  CAN_PELI_RXID2_ID11						 ((uint16_t)0x0040)
#define  CAN_PELI_RXID2_ID12						 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_PELI_TXID3 register  *******************/
#define  CAN_PELI_RXID3						         ((uint16_t)0x00FF)
#define  CAN_PELI_RXID3_ID00						 ((uint16_t)0x0008)
#define  CAN_PELI_RXID3_ID01						 ((uint16_t)0x0010)
#define  CAN_PELI_RXID3_ID02						 ((uint16_t)0x0020)
#define  CAN_PELI_RXID3_ID03						 ((uint16_t)0x0040)
#define  CAN_PELI_RXID3_ID04						 ((uint16_t)0x0080)

/*******************  Bit definition for CAN_PELI_RXDATA0 register  *******************/
#define  CAN_PELI_RXDATA0							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_RXDATA1 register  *******************/
#define  CAN_PELI_RXDATA1							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_RXDATA2 register  *******************/
#define  CAN_PELI_RXDATA2							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_RXDATA3 register  *******************/
#define  CAN_PELI_RXDATA3							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_RXDATA4 register  *******************/
#define  CAN_PELI_RXDATA4							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_RXDATA5 register  *******************/
#define  CAN_PELI_RXDATA5							 ((uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_RXDATA6 register  *******************/
#define  CAN_PELI_RXDATA6							 (uint16_t)0x00FF)
/*******************  Bit definition for CAN_PELI_RXDATA7 register  *******************/
#define  CAN_PELI_RXDATA7							 ((uint16_t)0x00FF)

/*******************  Bit definition for CAN_PELI_ACR0 register  *******************/
#define  CAN_PELI_ACR0_AC                          ((uint16_t)0x00FF)     
#define  CAN_PELI_ACR0_AC_0                        ((uint16_t)0x0001)   
#define  CAN_PELI_ACR0_AC_1                        ((uint16_t)0x0002) 
#define  CAN_PELI_ACR0_AC_2                        ((uint16_t)0x0004)  
#define  CAN_PELI_ACR0_AC_3                        ((uint16_t)0x0008)  
#define  CAN_PELI_ACR0_AC_4                        ((uint16_t)0x0010)  
#define  CAN_PELI_ACR0_AC_5                        ((uint16_t)0x0020)  
#define  CAN_PELI_ACR0_AC_6                        ((uint16_t)0x0040) 
#define  CAN_PELI_ACR0_AC_7                        ((uint16_t)0x0080)  

#define  CAN_PELI_ACR0_AC_SSID21                   ((uint16_t)0x0001)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID21*/
#define  CAN_PELI_ACR0_AC_SSID22                   ((uint16_t)0x0002)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID22*/
#define  CAN_PELI_ACR0_AC_SSID23                   ((uint16_t)0x0004)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID23*/
#define  CAN_PELI_ACR0_AC_SSID24                   ((uint16_t)0x0008)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID24*/
#define  CAN_PELI_ACR0_AC_SSID25                   ((uint16_t)0x0010)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID25*/
#define  CAN_PELI_ACR0_AC_SSID26                   ((uint16_t)0x0020)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID26*/
#define  CAN_PELI_ACR0_AC_SSID27                   ((uint16_t)0x0040)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID27*/
#define  CAN_PELI_ACR0_AC_SSID28                   ((uint16_t)0x0080)   /*FOR STANDARD FRAME SINGLE FILTER,CONFIG ID28*/

#define  CAN_PELI_ACR0_AC_ESID21                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID21*/
#define  CAN_PELI_ACR0_AC_ESID22                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID22*/
#define  CAN_PELI_ACR0_AC_ESID23                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID23*/
#define  CAN_PELI_ACR0_AC_ESID24                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID24*/
#define  CAN_PELI_ACR0_AC_ESID25                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID25*/
#define  CAN_PELI_ACR0_AC_ESID26                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID26*/
#define  CAN_PELI_ACR0_AC_ESID27                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID27*/
#define  CAN_PELI_ACR0_AC_ESID28                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME SINGLE FILTER,CONFIG ID28*/

