Samplecode-MM32/MM32W0xxxxB_samplecode/MM32W0xxxxB_s_samplecode/MM32W0xx_s_BLE_gcc_SV3.6.1/Device/MM32W0xx/Include/MM32W0xx.h
#define  CAN_PELI_AMR3_AM_SDDATA0_0                ((uint16_t)0x0010)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 0*/
#define  CAN_PELI_AMR3_AM_SDDATA0_1                ((uint16_t)0x0020)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 1*/
#define  CAN_PELI_AMR3_AM_SDDATA0_2                ((uint16_t)0x0040)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 2*/
#define  CAN_PELI_AMR3_AM_SDDATA0_3                ((uint16_t)0x0080)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG DATA0 BIT 3*/
#define  CAN_PELI_AMR3_AM_SDRTR                    ((uint16_t)0x0010)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG RTR*/
#define  CAN_PELI_AMR3_AM_SDID18                   ((uint16_t)0x0020)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID18*/
#define  CAN_PELI_AMR3_AM_SDID19                   ((uint16_t)0x0040)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID19*/
#define  CAN_PELI_AMR3_AM_SDID20                   ((uint16_t)0x0080)   /*FOR STANDARD FRAME DOUBLE FILTER,CONFIG ID20*/

#define  CAN_PELI_AMR3_AM_EDID13                   ((uint16_t)0x0001)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID13*/
#define  CAN_PELI_AMR3_AM_EDID14                   ((uint16_t)0x0002)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID14*/
#define  CAN_PELI_AMR3_AM_EDID15                   ((uint16_t)0x0004)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID15*/
#define  CAN_PELI_AMR3_AM_EDID16                   ((uint16_t)0x0008)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID16*/
#define  CAN_PELI_AMR3_AM_EDID17                   ((uint16_t)0x0010)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID17*/
#define  CAN_PELI_AMR3_AM_EDID18                   ((uint16_t)0x0020)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID18*/
#define  CAN_PELI_AMR3_AM_EDID19                   ((uint16_t)0x0040)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID19*/
#define  CAN_PELI_AMR3_AM_EDID20                   ((uint16_t)0x0080)   /*FOR EXTENDED FRAME DOUBLE FILTER,CONFIG ID20*/

/*******************  Bit definition for CAN_PELI_CDR register  *******************/
#define  CAN_PELI_CDR_MODE                         ((uint16_t)0x0080) 


/**
* @}
*/

/**
* @}
*/ 

#ifdef USE_STDPERIPH_DRIVER
#include "HAL_conf.h"
#endif

/** @addtogroup Exported_macro
* @{
*/

#define SET_BIT(REG, BIT)     ((REG) |= (BIT))

#define CLEAR_BIT(REG, BIT)   ((REG) &= ~(BIT))

#define READ_BIT(REG, BIT)    ((REG) & (BIT))

#define CLEAR_REG(REG)        ((REG) = (0x0))

#define WRITE_REG(REG, VAL)   ((REG) = (VAL))

#define READ_REG(REG)         ((REG))

#define MODIFY_REG(REG, CLEARMASK, SETMASK)  WRITE_REG((REG), (((READ_REG(REG)) & (~CLEARMASK)) | (SETMASK)))



/* Exported macro ------------------------------------------------------------*/
#ifdef  USE_FULL_ASSERT

/**
* @brief  The assert_param macro is used for function's parameters check.
* @param expr: If expr is false, it calls assert_failed function
*   which reports the name of the source file and the source
*   line number of the call that failed. 
*   If expr is true, it returns no value.
* @retval : None
*/
#define assert_param(expr) ((expr) ? (void)0 : assert_failed((uint8_t *)__FILE__, __LINE__))
/* Exported functions ------------------------------------------------------- */
void assert_failed(uint8_t* file, uint32_t line);
#else
#define assert_param(expr) ((void)0)
#endif /* USE_FULL_ASSERT */


/**
* @}
*/

#endif /* __MM32W0xx_H */

/**
* @}
*/

/**
* @}
*/

/*-------------------------(C) COPYRIGHT 2017 MindMotion ----------------------*/
